Revit 2024 API
PointCollection.GetPointBufferPointer Method
 Returns an unsafe pointer to the buffer in which this collection stores the points.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public IntPtr GetPointBufferPointer()
Visual Basic
Public Function GetPointBufferPointer As IntPtr
Visual C++
public:
IntPtr GetPointBufferPointer()
Return Value
 The pointer to the collection's storage.
See Also
PointCollection Class
Autodesk.Revit.DB.PointClouds Namespace